---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.DivisionSketchOverlap
source: html/d294391d-151a-89ee-34eb-f0725768ff1a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.DivisionSketchOverlap Property

Curves in the sketch of the Division overlap.

## Syntax (C#)
```csharp
public static FailureDefinitionId DivisionSketchOverlap { get; }
```